Repository: Niklp09/castle_gates
Catalog: locale/*.po
Languages: it

source: Heavy wooden bars designed to prevent entry even to siege equipment.
it: Pesanti sbarre di legno progettate per impedire l'accesso perfino all'equipaggiamento da assedio.

source: Place these bars in a structure together and they will slide as a unified gate when clicked on.
it: Componete una struttura mettendo insieme queste sbarre ed esse scorreranno come un'unica saracinesca quando ci si cliccherà sopra.

source: The bottom edge of a portcullis gate, with knobs to lock securely into the floor.
it: La parte inferiore di una saracinesca, con puntali per bloccarsi saldamente nel pavimento.

source: This block can be used to define the edge of a portcullius that meets up with another gate, should you have an arrangement like that. Otherwise it's just decorative.
it: Questo blocco può essere usato per definire l'estremità di una saracinesca che si incontra con un'altra, se doveste avere una tale disposizione. Altrimenti è solo decorativo.

source: A basic gate panel.
it: Un pannello di base per cancelli, porte e portoni.

source: This gate segment will move in unison with adjoining gate segments when right-clicked.
it: Questo segmento si muoverà all'unisono con altri segmenti adiacenti quando cliccato col tasto destro.

source: A gate panel with a defined edge.
it: Un pannello per cancelli, porte e portoni avente un'estremità definita.

source: The darkened edge of this panel marks the edge of the gate it's a part of. You can use these when building double doors to ensure the two parts swing separately, for example. Note that edges aren't strictly necessary for gates that stand alone.
it: L'estremità annerita di questo pannello contrassegna il bordo del cancello, porta o portone di cui fa parte. Per esempio potete usarla quando costruite doppi battenti per assicurarvi che le due parti ruotino separatamente. Si noti che queste estremità non sono strettamente necessarie per cancelli, porte e portoni a battente singolo.

source: A gate edge with a handle.
it: Una estremità di cancello, porta o portone con una maniglia.

source: The handle is basically decorative, a door this size can be swung by clicking anywhere on it. But the darkened edge of this panel is useful for defining the edge of a gate when it abuts a partner to the side.
it: Fondamentalmente la maniglia è decorativa, un cancello o porta di queste dimensioni possono essere aperti cliccando un punto qualunque su di essi. Ma il bordo annerito di questo pannello è utile per stabilire la fine di un battente quando confina con un altro.

source: A hinged gate segment that allows a gate to swing.
it: Un segmento di cancello, porta o portone provvisto di un cardine che ne consente la rotazione.

source: If you have more than one hinge in your gate, make sure the hinges line up correctly otherwise the gate will not be able to swing. The hinge is the protruding block along the edge of the gate panel.
it: Se avete più di un cardine nel vostro cancello, porta o portone, accertatevi che siano allineati correttamente altrimenti non potrà ruotare. Il cardine è la protuberanza lungo il bordo del pannello.

source: A block with a slot to allow an adjacent sliding gate through.
it: Un blocco provvisto di una fessura per consentire a una porta scorrevole di scivolarci attraverso.

source: This block is designed to extend into a neighboring node that a sliding gate passes through, to provide a tight seal for the gate to move through without allowing anything else to squeeze in.
it: Questo blocco è progettato per estendersi in un nodo vicino attraverso cui scivoli una porta scorrevole, per fornire una chiusura ermetica alla porta o saracinesca che gli passa attraverso senza permettere a niente altro di intrufolarvisi.

source: A block that extends into an adjacent node to provide a tight seal for a large gate.
it: Un blocco che si estende in un nodo adiacente per fornire una chiusura ermetica per un portone.

source: Two nodes cannot occupy the same space, but this block extends into a neighboring node's space to allow for gates to form a tight seal. It can be used with sliding gates or swinging gates.
it: Due nodi non possono occupare lo stesso spazio, ma questo blocco si estende nello spazio di un nodo vicino per consentire a cancelli, porte, portoni e saracinesche di formare una chiusura ermetica. Può essere usato con porte scorrevoli o a rotazione.

source: Gates
it: Cancelli, porte, portoni e saracinesche

source: Gates are large multi-node constructions that swing on hinges or slide out of the way when triggered.
it: Cancelli, porte, portoni e saracinesche sono costruzioni multi-nodo che quando vengono attivate ruotano su dei cardini o scivolano via.

source: Gate construction
it: Costruzione di cancelli, porte, portoni e saracinesche

source: Gates are multi-node constructions, usually (though not always) consisting of multiple node types that fit together into a unified whole. The orientation of gate nodes is significant, so a screwdriver will be a helpful tool when constructing gates. A gate's extent is determined by a "flood fill" operation. When you trigger a gate block, all compatible neighboring blocks will be considered part of the same structure and will move in unison. Only gate blocks that are aligned with each other will be considered part of the same gate. If you wish to build adjoining gates (for example, a large pair of double doors that meet in the center) you'll need to make use of gate edge blocks to prevent it all from being considered one big door. Note that if your gate does not abut any other gates you don't actually need to define its edges this way - you don't have to use edge blocks in this case. If a gate has no hinge nodes it will be considered a sliding gate. When triggered, the gate code will search for a direction that the gate can slide in and will move it in that direction at a rate of one block-length per second. Once it reaches an obstruction it will stop, and when triggered again it will try sliding in the opposite direction. If a gate has hinge nodes then triggering it will cause the gate to try swinging around the hinge. If the gate has multiple hinges and they don't line up properly the gate will be unable to move. Note that the gate can only exist in 90-degree increments of orientation, but the gate still looks for obstructions in the region it is swinging through and will not swing if there's something in the way.
it: Cancelli, porte, portoni e saracinesche sono costruzioni multi-nodo, di solito (anche se non sempre) costituite da molteplici tipi di nodi che si uniscono in un tutt'uno. L'orientamento è importante, perciò un cacciavite sarà uno strumento utile quando si costruiscono cancelli, porte, ecc. L'estensione di cancelli e simili è stabilita da un'operazione "flood fill" (allagamento riempitivo). Quando attivate un blocco di cancello, tutte le parti limitrofe compatibili verranno considerate parte della stessa struttura e si muoveranno all'unisono. Solamente i blocchi che sono allineati l'un l'altro saranno considerati come parte dello stesso cancello. Se desiderate costruire cancelli confinanti (per esempio, un paio di grossi battenti che si incontrano nel mezzo) dovrete fare uso dei blocchi-estremità per impedire che il tutto sia considerato come un'unica grossa porta. Si noti che se il vostro cancello non confina con nessun altro non avete la necessità di definirne le estremità in questo modo - in questo caso non è necessario che usiate blocchi-estremità. Se un cancello, ecc. non ha nodi coi cardini sarà considerato come scorrevole. Quando attivato, il programma del cancello cercherà una direzione in cui possa scivolare e lo muoverà in quella direzione al passo della distanza di un nodo al secondo. Quando raggiungerà un ostacolo si fermerà, e quando attivato ancora tenterà di scorrere nella direzione opposta. Se un cancello, ecc. ha dei nodi coi cardini, attivandolo lo si farà ruotare attorno al cardine. Se il cancello ha più cardini e questi non sono allineati correttamente non riuscirà a muoversi. Si noti che il cancello può svilupparsi solo in incrementi di 90° di orientamento, e controllerà la presenza di ostacoli nella zona in cui ruota e non ruoterà se c'è qualcosa di mezzo.

source: Oak Door
it: Porta di quercia

source: Jail Door
it: Porta della prigione

source: Jail Bars
it: Sbarre della prigione

source: @1 Portcullis Bars
it: Sbarre della saracinesca di @1

source: @1 Portcullis Bottom
it: Estremità inferiore della saracinesca di @1

source: @1 Gate Door
it: Porta di @1 del cancello

source: @1 Gate Door Edge
it: Estremità della porta di @1 del cancello

source: @1 Gate Door With Handle
it: Porta di @1 con maniglia del cancello

source: @1 Gate Door With Hinge
it: Porta di @1 con cardine del cancello

source: Wooden
it: legno

source: Steel
it: acciaio

source: Stonebrick
it: mattone di pietra

source: @1 Gate Slot
it: Alloggio di @1 per cancelli, porte, portoni e saracinesche

source: @1 Gate Slot Reverse
it: Rovescio dell'alloggio di @1 per cancelli, porte, portoni e saracinesche
